### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [5]:
# 1) read_csv() - Used to read data from a CSV file and create a DataFrame object
df =pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
# 2) groupby() - Used to group rows of a DataFrame based on a certain column and apply an aggregate function.

In [8]:
df.groupby('Sex').sum()

        PassengerId  Survived  Pclass       Age  SibSp  Parch        Fare
Sex
female       135343       233     678   7286.00    218    204  13966.6628
male         262043       109    1379  13919.17    248    136  14727.2865

In [12]:
# 3) loc() -  used for label-based indexing, meaning we can select data based on the row and column labels.
df.loc[0:4,['Name', 'Sex', 'Age']]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

In [13]:
# 4) iloc - used for integer-based indexing, meaning we can select data based on the row and column positions
df.iloc[0:5,[3,4,5]]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

In [17]:
# fillna() - used to fill missing values in a DataFrame with a specified value
df.fillna('Filled',inplace=True)

In [18]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [20]:
s1 = ['Chang','Ganesh','Saimon']
s2 = ['Sikkim','Delhi','Goa']
s3 = [34313414,45454252,5653455]
df1 = pd.DataFrame({'A':s1,'B':s2,'C':s3})
df1

        A       B         C
0   Chang  Sikkim  34313414
1  Ganesh   Delhi  45454252
2  Saimon     Goa   5653455

In [31]:
def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, step=2, stop=len(df)*2)
    df = df.set_index(new_index)
    return df
reindex_dataframe(df1)

        A       B         C
1   Chang  Sikkim  34313414
3  Ganesh   Delhi  45454252
5  Saimon     Goa   5653455

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [43]:
l1 = ['Sikkim','Delhi','Goa','Chennai']
l2 = [234,321,125,440]
df2 = pd.DataFrame({'State':l1,'Values':l2})
df2

     State  Values
0   Sikkim     234
1    Delhi     321
2      Goa     125
3  Chennai     440

In [48]:
def find_sum(df):
    total = 0
    for i,j in df.iterrows():
        if i < 3:
            total += j['Values']
    return 'The total value is {}'.format(total)
find_sum(df2)

'The total value is 680'

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [3]:
a = 'Most of the research to-date on creatine has predominantly focused on the pharmacological properties of creatine, yet there is a lack of research into the pharmacokinetics of creatine. Studies have not established pharmacokinetic parameters for clinical usage of creatine such as volume of distribution, clearance, bioavailability, mean residence time, absorption rate, and half life. A clear pharmacokinetic profile would need to be established prior to optimal clinical dosing.'
b = 'Sikkim is a state in northeast India, bordered by Bhutan, Tibet and Nepal. Part of the Himalayas, the area has a dramatic landscape that includes India’s highest mountain, 8,586m Kangchenjunga.'
c = 'Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.'

In [8]:
df3 = pd.DataFrame({'Text':[a,b,c]})

In [10]:
pd.set_option('display.max_colwidth',300)

In [11]:
df3

                                                                                                                                                                                                                                                                                                          Text
0  Most of the research to-date on creatine has predominantly focused on the pharmacological properties of creatine, yet there is a lack of research into the pharmacokinetics of creatine. Studies have not established pharmacokinetic parameters for clinical usage of creatine such as volume of distri...
1                                                                                                            Sikkim is a state in northeast India, bordered by Bhutan, Tibet and Nepal. Part of the Himalayas, the area has a dramatic landscape that includes India’s highest mountain, 8,586m Kangchenjunga.
2                     Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.

In [20]:
def word_count(df):
    df['word_count'] = df['Text'].apply(lambda x: len(x.split()))
    return df

In [21]:
word_count(df3)

,Text,word_count
0,"Most of the research to-date on creatine has predominantly focused on the pharmacological properties of creatine, yet there is a lack of research into the pharmacokinetics of creatine. Studies have not established pharmacokinetic parameters for clinical usage of creatine such as volume of distri...",68
1,"Sikkim is a state in northeast India, bordered by Bhutan, Tibet and Nepal. Part of the Himalayas, the area has a dramatic landscape that includes India’s highest mountain, 8,586m Kangchenjunga.",30
2,"Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.",40

### Q5. How are DataFrame.size() and DataFrame.shape() different?

- DataFrame.size returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns in the DataFrame.It returns the total number of values in the DataFrame.
- DataFrame.shape returns a tuple of two values representing the dimensions of the DataFrame. The first value is the number of rows and the second value is the number of columns in the DataFrame.It  returns information about the number of rows and columns in the DataFrame.

In [23]:
s1 = ['Chang','Ganesh','Saimon']
s2 = ['Sikkim','Delhi','Goa']
s3 = [34313414,45454252,5653455]
df4 = pd.DataFrame({'A':s1,'B':s2,'C':s3})
df4

        A       B         C
0   Chang  Sikkim  34313414
1  Ganesh   Delhi  45454252
2  Saimon     Goa   5653455

In [25]:
df4.shape

(3, 3)

In [26]:
df4.size

9

### Q6. Which function of pandas do we use to read an excel file?

#### we can use read_excel() function to read excel file

In [27]:
excel_data = pd.read_excel('LUSID Excel - Setting up your market data.xlsx')

In [28]:
excel_data.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for use with LUSID,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [52]:
email = ['chang.rai@gmail.com','rahul.rajput@yahoo.com','ganesh.sharma@outlook.com','simon.chettri@xay.com','subham.kumar@iern.com']

In [53]:
df5 = pd.DataFrame({'Email':email})

In [54]:
df5

                       Email
0        chang.rai@gmail.com
1     rahul.rajput@yahoo.com
2  ganesh.sharma@outlook.com
3      simon.chettri@xay.com
4      subham.kumar@iern.com

In [55]:
def username_extractor(df):
    df['UserName'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

In [56]:
username_extractor(df5)

                       Email       UserName
0        chang.rai@gmail.com      chang.rai
1     rahul.rajput@yahoo.com   rahul.rajput
2  ganesh.sharma@outlook.com  ganesh.sharma
3      simon.chettri@xay.com  simon.chettri
4      subham.kumar@iern.com   subham.kumar

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [9]:
n1 = [3,8,6,2,9]
n2 = [5,2,9,3,1]
n3 = [1,7,4,5,2]
df6 = pd.DataFrame({'A':n1,'B':n2,'C':n3})

In [10]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [11]:
def test(df):
    new_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return new_df

In [12]:
test(df6)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [4]:
s1 = ['Chang','Ganesh','Saimon']
s2 = ['Sikkim','Delhi','Goa']
s3 = [34,45,56]
df7 = pd.DataFrame({'A':s1,'B':s2,'Values':s3})
df7

        A       B  Values
0   Chang  Sikkim      34
1  Ganesh   Delhi      45
2  Saimon     Goa      56

In [15]:
def fun(df):
    a = df['Values'].mean()
    b = df['Values'].median()
    c = df['Values'].std()
    return 'For the given value column the mean is {} , median is {} and standard deviation is {}'.format(a,b,c)

In [16]:
fun(df7)

'For the given value column the mean is 45.0 , median is 45.0 and standard deviation is 11.0'

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [35]:
dte = pd.date_range(start='2023-02-28',end='2023-03-30')

In [36]:
len(dte)

31

In [37]:
import numpy as np

In [38]:
sle = np.random.randint(50,100,31)

In [39]:
len(sle)

31

In [40]:
df8 = pd.DataFrame({'Date':dte,'Sales':sle})

In [41]:
df8.head()

        Date  Sales
0 2023-02-28     87
1 2023-03-01     98
2 2023-03-02     98
3 2023-03-03     85
4 2023-03-04     69

In [45]:
def mavg(df):
    df['Moving Average'] = df['Sales'].rolling(window=7,min_periods=1).mean()
    return df

In [46]:
mavg(df8)

         Date  Sales  Moving Average
0  2023-02-28     87       87.000000
1  2023-03-01     98       92.500000
2  2023-03-02     98       94.333333
3  2023-03-03     85       92.000000
4  2023-03-04     69       87.400000
5  2023-03-05     74       85.166667
6  2023-03-06     95       86.571429
7  2023-03-07     66       83.571429
8  2023-03-08     83       81.428571
9  2023-03-09     64       76.571429
10 2023-03-10     89       77.142857
11 2023-03-11     94       80.714286
12 2023-03-12     62       79.000000
13 2023-03-13     58       73.714286
14 2023-03-14     57       72.428571
15 2023-03-15     60       69.142857
16 2023-03-16     60       68.571429
17 2023-03-17     53       63.428571
18 2023-03-18     82       61.714286
19 2023-03-19     89       65.571429
20 2023-03-20     89       70.000000
21 2023-03-21     73       72.285714
22 2023-03-22     72       74.000000
23 2023-03-23     56       73.428571
24 2023-03-24     90       78.714286
25 2023-03-25     77       78.000000
26 2023-03-26     85       77.428571
27 2023-03-27     92       77.857143
28 2023-03-28     90       80.285714
29 2023-03-29     50       77.142857
30 2023-03-30     72       79.428571

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [54]:
dt = pd.to_datetime('2022-05-30	')
dt.day_name()

'Monday'

In [55]:
new_date = dte = pd.date_range(start='2023-02-28',end='2023-03-30')

In [57]:
df9 = pd.DataFrame({'Date':new_date})

In [61]:
def make_weekday(df):
    df['WeekDay'] = df['Date'].apply(lambda x: x.day_name())
    return df

In [62]:
make_weekday(df9)

         Date    WeekDay
0  2023-02-28    Tuesday
1  2023-03-01  Wednesday
2  2023-03-02   Thursday
3  2023-03-03     Friday
4  2023-03-04   Saturday
5  2023-03-05     Sunday
6  2023-03-06     Monday
7  2023-03-07    Tuesday
8  2023-03-08  Wednesday
9  2023-03-09   Thursday
10 2023-03-10     Friday
11 2023-03-11   Saturday
12 2023-03-12     Sunday
13 2023-03-13     Monday
14 2023-03-14    Tuesday
15 2023-03-15  Wednesday
16 2023-03-16   Thursday
17 2023-03-17     Friday
18 2023-03-18   Saturday
19 2023-03-19     Sunday
20 2023-03-20     Monday
21 2023-03-21    Tuesday
22 2023-03-22  Wednesday
23 2023-03-23   Thursday
24 2023-03-24     Friday
25 2023-03-25   Saturday
26 2023-03-26     Sunday
27 2023-03-27     Monday
28 2023-03-28    Tuesday
29 2023-03-29  Wednesday
30 2023-03-30   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [63]:
new_date1 = dte = pd.date_range(start='2022-12-18',end='2023-02-05')

In [66]:
new_date1

DatetimeIndex(['2022-12-18', '2022-12-19', '2022-12-20', '2022-12-21',
               '2022-12-22', '2022-12-23', '2022-12-24', '2022-12-25',
               '2022-12-26', '2022-12-27', '2022-12-28', '2022-12-29',
               '2022-12-30', '2022-12-31', '2023-01-01', '2023-01-02',
               '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06',
               '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10',
               '2023-01-11', '2023-01-12', '2023-01-13', '2023-01-14',
               '2023-01-15', '2023-01-16', '2023-01-17', '2023-01-18',
               '2023-01-19', '2023-01-20', '2023-01-21', '2023-01-22',
               '2023-01-23', '2023-01-24', '2023-01-25', '2023-01-26',
               '2023-01-27', '2023-01-28', '2023-01-29', '2023-01-30',
               '2023-01-31', '2023-02-01', '2023-02-02', '2023-02-03',
               '2023-02-04', '2023-02-05'],
              dtype='datetime64[ns]', freq='D')

In [67]:
df10 = pd.DataFrame({'Date':new_date1})

In [68]:
df10.head()

        Date
0 2022-12-18
1 2022-12-19
2 2022-12-20
3 2022-12-21
4 2022-12-22

In [86]:
def extract_date(df):
    filtered_date = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return filtered_date

In [87]:
extract_date(df10)

         Date
14 2023-01-01
15 2023-01-02
16 2023-01-03
17 2023-01-04
18 2023-01-05
19 2023-01-06
20 2023-01-07
21 2023-01-08
22 2023-01-09
23 2023-01-10
24 2023-01-11
25 2023-01-12
26 2023-01-13
27 2023-01-14
28 2023-01-15
29 2023-01-16
30 2023-01-17
31 2023-01-18
32 2023-01-19
33 2023-01-20
34 2023-01-21
35 2023-01-22
36 2023-01-23
37 2023-01-24
38 2023-01-25
39 2023-01-26
40 2023-01-27
41 2023-01-28
42 2023-01-29
43 2023-01-30
44 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

#### The first and foremost necessary library that needs to be imported is the pandas library itself

In [89]:
# refrence
import pandas as pd